//给定一个已排序的正整数数组 nums，和一个正整数 n 。从 [1, n] 区间内选取任意个数字补充到 nums 中，使得 [1, n] 区间内的任何数字都
//可以用 nums 中某几个数字的和来表示。请输出满足上述要求的最少需要补充的数字个数。 
//
// 示例 1: 
//
// 输入: nums = [1,3], n = 6
//输出: 1 
//解释:
//根据 nums 里现有的组合 [1], [3], [1,3]，可以得出 1, 3, 4。
//现在如果我们将 2 添加到 nums 中， 组合变为: [1], [2], [3], [1,3], [2,3], [1,2,3]。
//其和可以表示数字 1, 2, 3, 4, 5, 6，能够覆盖 [1, 6] 区间里所有的数。
//所以我们最少需要添加一个数字。 
//
// 示例 2: 
//
// 输入: nums = [1,5,10], n = 20
//输出: 2
//解释: 我们需要添加 [2, 4]。
// 
//
// 示例 3: 
//
// 输入: nums = [1,2,2], n = 5
//输出: 0
// 
// Related Topics 贪心算法 
// 👍 226 👎 0

#include "header.h"

namespace LeetCode330 {

//leetcode submit region begin(Prohibit modification and deletion)
class Solution {
public:
    int minPatches(vector<int>& nums, int n) {
      return solution1(nums, n);
    }

    int solution1(vector<int>& nums, int n) {
      int ans = 0;  // 需要补充的数字
      long long total = 1;  // 累加的总和
      int length = nums.size(), idx = 0;

      while (total <= n) {
        if (idx < length && nums[idx] <= total) {
          // 如果数组能组成的数字范围是 [1, total), 那么就加上 nums[idx]
          // 其能表达的数字范围是 [1, total) U [nums[idx], total+nums[idx])
          // 结果就是 [1, total+nums[idx])
          total += nums[idx++];
        } else {
          // 当无法表示时，此处范围为 [1, total)
          // 此时添加一个新数字，其值为 total
          // 则能够表示的最大范围为 [1, 2*total-1)
          total <<= 1;
          ans++;
        }
      }
      return ans;
    }
};
//leetcode submit region end(Prohibit modification and deletion)

}