//爱丽丝和鲍勃有不同大小的糖果棒：A[i] 是爱丽丝拥有的第 i 根糖果棒的大小，B[j] 是鲍勃拥有的第 j 根糖果棒的大小。 
//
// 因为他们是朋友，所以他们想交换一根糖果棒，这样交换后，他们都有相同的糖果总量。（一个人拥有的糖果总量是他们拥有的糖果棒大小的总和。） 
//
// 返回一个整数数组 ans，其中 ans[0] 是爱丽丝必须交换的糖果棒的大小，ans[1] 是 Bob 必须交换的糖果棒的大小。 
//
// 如果有多个答案，你可以返回其中任何一个。保证答案存在。 
//
// 
//
// 示例 1： 
//
// 
//输入：A = [1,1], B = [2,2]
//输出：[1,2]
// 
//
// 示例 2： 
//
// 
//输入：A = [1,2], B = [2,3]
//输出：[1,2]
// 
//
// 示例 3： 
//
// 
//输入：A = [2], B = [1,3]
//输出：[2,3]
// 
//
// 示例 4： 
//
// 
//输入：A = [1,2,5], B = [2,4]
//输出：[5,4]
// 
//
// 
//
// 提示： 
//
// 
// 1 <= A.length <= 10000 
// 1 <= B.length <= 10000 
// 1 <= A[i] <= 100000 
// 1 <= B[i] <= 100000 
// 保证爱丽丝与鲍勃的糖果总量不同。 
// 答案肯定存在。 
// 
// Related Topics 数组 
// 👍 117 👎 0

#include "header.h"

namespace LeetCode888 {

//leetcode submit region begin(Prohibit modification and deletion)
class Solution {
public:
    vector<int> fairCandySwap(vector<int>& A, vector<int>& B) {
      return solution1(A, B);
    }

    // O( n+m ), O( m )
    vector<int> solution1(vector<int>& A, vector<int>& B) {
      int A_sum = 0, B_sum = 0;
      for (int i : A) A_sum += i;
      unordered_set<int> rec(B.begin(), B.end());
      for (int i : B) B_sum += i;
      int mid = (A_sum + B_sum) / 2;  // 交换之后每个人持有的糖果总量

      for (int i : A) {
        int need = mid - A_sum + i;
        // 在 B 中找到符合的结果
        if (rec.count(need)) return {i, need};
      }
      return {-1, -1};  // 无解
    }
};
//leetcode submit region end(Prohibit modification and deletion)

}